<a href="https://colab.research.google.com/github/Blackman9t/Machine_Learning/blob/master/RecSys_Collaborative_Filtering_movies_v1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<a href="https://www.bigdatauniversity.com"><img src="https://ibm.box.com/shared/static/cw2c7r3o20w9zn8gkecaeyjhgw3xdgbj.png" width="400" align="center"></a>

<h1 align="center"><font size="5">COLLABORATIVE FILTERING</font></h1>

Recommendation systems are a collection of algorithms used to recommend items to users based on information taken from the user. These systems have become ubiquitous can be commonly seen in online stores, movies databases and job finders. In this notebook, we will explore recommendation systems based on Collaborative Filtering and implement simple version of one using Python and the Pandas library.

<h1>Table of contents</h1>

<div class="alert alert-block alert-info" style="margin-top: 20px">
    <ol>
        <li><a href="#ref1">Acquiring the Data</a></li>
        <li><a href="#ref2">Preprocessing</a></li>
        <li><a href="#ref3">Collaborative Filtering</a></li>
    </ol>
</div>
<br>
<hr>



<a id="ref1"></a>
# Acquiring the Data

To acquire and extract the data, simply run the following Bash scripts:  
Dataset acquired from [GroupLens](http://grouplens.org/datasets/movielens/). Lets download the dataset. To download the data, we will use **`!wget`** to download it from IBM Object Storage.  
__Did you know?__ When it comes to Machine Learning, you will likely be working with large datasets. As a business, where can you host your data? IBM is offering a unique opportunity for businesses, with 10 Tb of IBM Cloud Object Storage: [Sign up now for free](http://cocl.us/ML0101EN-IBM-Offer-CC)

In [1]:
!wget -O moviedataset.zip https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/ML0101ENv3/labs/moviedataset.zip
print('unziping ...')
!unzip -o -j moviedataset.zip

--2019-05-17 18:44:07--  https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/ML0101ENv3/labs/moviedataset.zip
Resolving s3-api.us-geo.objectstorage.softlayer.net (s3-api.us-geo.objectstorage.softlayer.net)... 67.228.254.193
Connecting to s3-api.us-geo.objectstorage.softlayer.net (s3-api.us-geo.objectstorage.softlayer.net)|67.228.254.193|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 160301210 (153M) [application/zip]
Saving to: ‘moviedataset.zip’

moviedataset.zip    100%[===================>] 152.88M  25.9MB/s    in 5.8s

2019-05-17 18:44:13 (26.6 MB/s) - ‘moviedataset.zip’ saved [160301210/160301210]

unziping ...
Archive:  moviedataset.zip
  inflating: links.csv
  inflating: movies.csv
  inflating: ratings.csv
  inflating: README.txt
  inflating: tags.csv

Now you're ready to start working with the data!

<hr>

<a id="ref2"></a>
# Preprocessing

First, let's get all of the imports out of the way:

In [0]:
#Dataframe manipulation library
import pandas as pd
#Math functions, we'll only need the sqrt function so let's import only that
from math import sqrt
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

Now let's read each file into their Dataframes:

In [0]:
#Storing the movie information into a pandas dataframe
movies_df = pd.read_csv('movies.csv')
#Storing the user information into a pandas dataframe
ratings_df = pd.read_csv('ratings.csv')

Let's also take a peek at how each of them are organized:

In [5]:
#Head is a function that gets the first N rows of a dataframe. N's default is 5.
movies_df.head()

   movieId  ...                                       genres
0        1  ...  Adventure|Animation|Children|Comedy|Fantasy
1        2  ...                   Adventure|Children|Fantasy
2        3  ...                               Comedy|Romance
3        4  ...                         Comedy|Drama|Romance
4        5  ...                                       Comedy

[5 rows x 3 columns]

So each movie has a unique ID, a title with its release year along with it (Which may contain unicode characters) and several different genres in the same field. Let's remove the year from the title column and place it into its own one by using the handy [extract](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.str.extract.html#pandas.Series.str.extract) function that Pandas has.

Let's remove the year from the __title__ column by using pandas' replace function and store in a new __year__ column.

In [6]:
#Using regular expressions to find a year stored between parentheses
#We specify the parantheses so we don't conflict with movies that have years in their titles
movies_df['year'] = movies_df.title.str.extract('(\(\d\d\d\d\))',expand=False)
movies_df.head(3)

   movieId  ...    year
0        1  ...  (1995)
1        2  ...  (1995)
2        3  ...  (1995)

[3 rows x 4 columns]

In [7]:
#Removing the parentheses
movies_df['year'] = movies_df.year.str.extract('(\d\d\d\d)',expand=False)
movies_df.head(3)

   movieId  ...  year
0        1  ...  1995
1        2  ...  1995
2        3  ...  1995

[3 rows x 4 columns]

In [8]:
#Removing the years from the 'title' column
movies_df['title'] = movies_df.title.str.replace('(\(\d\d\d\d\))', '')
movies_df.head(3)

   movieId  ...  year
0        1  ...  1995
1        2  ...  1995
2        3  ...  1995

[3 rows x 4 columns]

In [0]:
#Applying the strip function to get rid of any ending whitespace characters that may have appeared
movies_df['title'] = movies_df['title'].apply(lambda x: x.strip())

Let's look at the result!

In [10]:
movies_df.head()

   movieId  ...  year
0        1  ...  1995
1        2  ...  1995
2        3  ...  1995
3        4  ...  1995
4        5  ...  1995

[5 rows x 4 columns]

With that, let's also drop the genres column since we won't need it for this particular recommendation system.

In [0]:
#Dropping the genres column
movies_df = movies_df.drop('genres', 1)

Here's the final movies dataframe:

In [12]:
movies_df.head()

   movieId                        title  year
0        1                    Toy Story  1995
1        2                      Jumanji  1995
2        3             Grumpier Old Men  1995
3        4            Waiting to Exhale  1995
4        5  Father of the Bride Part II  1995

<br>

Next, let's look at the ratings dataframe.

In [13]:
ratings_df.head()

   userId  movieId  rating   timestamp
0       1      169     2.5  1204927694
1       1     2471     3.0  1204927438
2       1    48516     5.0  1204927435
3       2     2571     3.5  1436165433
4       2   109487     4.0  1436165496

Every row in the ratings dataframe has a user id associated with at least one movie, a rating and a timestamp showing when they reviewed it. We won't be needing the timestamp column, so let's drop it to save on memory.

In [0]:
#Drop removes a specified row or column from a dataframe
ratings_df = ratings_df.drop('timestamp', 1)

Here's how the final ratings Dataframe looks like:

In [15]:
ratings_df.head()

   userId  movieId  rating
0       1      169     2.5
1       1     2471     3.0
2       1    48516     5.0
3       2     2571     3.5
4       2   109487     4.0

<hr>

<a id="ref3"></a>
# Collaborative Filtering

Now, time to start our work on recommendation systems. 

The first technique we're going to take a look at is called __Collaborative Filtering__, which is also known as __User-User Filtering__. As hinted by its alternate name, this technique uses other users to recommend items to the input user. It attempts to find users that have similar preferences and opinions as the input and then recommends items that they have liked to the input. There are several methods of finding similar users (Even some making use of Machine Learning), and the one we will be using here is going to be based on the __Pearson Correlation Function__.

<img src="https://ibm.box.com/shared/static/1ql8cbwhtkmbr6nge5e706ikzm5mua5w.png" width=800px>


The process for creating a User Based recommendation system is as follows:
- Select a user with the movies the user has watched
- Based on his rating to movies, find the top X neighbours 
- Get the watched movie record of the user for each neighbour.
- Calculate a similarity score using some formula
- Recommend the items with the highest score


Let's begin by creating an input user to recommend movies to:

Notice: To add more movies, simply increase the amount of elements in the userInput. Feel free to add more in! Just be sure to write it in with capital letters and if a movie starts with a "The", like "The Matrix" then write it in like this: 'Matrix, The' .

In [24]:
userInput = [
            {'title':'Breakfast Club, The', 'rating':5},
            {'title':'Toy Story', 'rating':3.5},
            {'title':'Jumanji', 'rating':2},
            {'title':"Pulp Fiction", 'rating':5},
            {'title':'Akira', 'rating':4.5},
            {'title':'Juice','rating':3.5},
            {'title':'Hidden, The','rating':4},
            {'title':'Sound of Music, The','rating':4.5}
         ] 
inputMovies = pd.DataFrame(userInput)
inputMovies

   rating                title
0     5.0  Breakfast Club, The
1     3.5            Toy Story
2     2.0              Jumanji
3     5.0         Pulp Fiction
4     4.5                Akira
5     3.5                Juice
6     4.0          Hidden, The
7     4.5  Sound of Music, The

#### Add movieId to input user
With the input complete, let's extract the input movies's ID's from the movies dataframe and add them into it.

We can achieve this by first filtering out the rows that contain the input movies' title and then merging this subset with the input dataframe. We also drop unnecessary columns for the input to save memory space.

In [25]:
#Filtering out the movies by title
inputId = movies_df[movies_df['title'].isin(inputMovies['title'].tolist())]
inputId

      movieId                title  year
0           1            Toy Story  1995
1           2              Jumanji  1995
293       296         Pulp Fiction  1994
1016     1035  Sound of Music, The  1965
1246     1274                Akira  1988
1885     1968  Breakfast Club, The  1985
3486     3576          Hidden, The  1987
7911     8593                Juice  1992

In [26]:
#Then merging it so we can get the movieId. It's implicitly merging it by title.
inputMovies = pd.merge(inputId, inputMovies)
inputMovies

   movieId                title  year  rating
0        1            Toy Story  1995     3.5
1        2              Jumanji  1995     2.0
2      296         Pulp Fiction  1994     5.0
3     1035  Sound of Music, The  1965     4.5
4     1274                Akira  1988     4.5
5     1968  Breakfast Club, The  1985     5.0
6     3576          Hidden, The  1987     4.0
7     8593                Juice  1992     3.5

In [27]:
#Dropping information we won't use from the input dataframe
inputMovies = inputMovies.drop('year', 1)
#Final input dataframe
#If a movie you added in above isn't here, then it might not be in the original 
#dataframe or it might spelled differently, please check capitalisation.
inputMovies

   movieId                title  rating
0        1            Toy Story     3.5
1        2              Jumanji     2.0
2      296         Pulp Fiction     5.0
3     1035  Sound of Music, The     4.5
4     1274                Akira     4.5
5     1968  Breakfast Club, The     5.0
6     3576          Hidden, The     4.0
7     8593                Juice     3.5

#### The users who has seen the same movies
Now with the movie ID's in our input, we can now get the subset of users that have watched and reviewed the movies in our input.

In [28]:
#Filtering out users that have watched movies that the input has watched and storing it
userSubset = ratings_df[ratings_df['movieId'].isin(inputMovies['movieId'].tolist())]
userSubset.head()

     userId  movieId  rating
19        4      296     4.0
441      12     1968     3.0
479      13        2     2.0
531      13     1274     5.0
681      14      296     2.0

In [29]:
userSubset.shape

(213139, 3)

In [30]:
ratings_df.shape

(22884377, 3)

In [32]:
movies_df.shape

(34208, 3)

We now group up the rows by user ID.

In [34]:
#Groupby creates several sub dataframes where they all have the same value in the column specified as the parameter
userSubsetGroup = userSubset.groupby(['userId'])
userSubsetGroup

lets look at one of the users, e.g. the one with userID=1130

In [52]:
userSubsetGroup.get_group(1130)

        userId  movieId  rating
104167    1130        1     0.5
104168    1130        2     4.0
104214    1130      296     4.0
104302    1130     1035     4.0
104363    1130     1274     4.5
104443    1130     1968     4.5

Let's also sort these groups so the users that share the most movies in common with the input have higher priority. This provides a richer recommendation since we won't go through every single user.

In [0]:
#Sorting it so users with movie most in common with the input will have priority
userSubsetGroup = sorted(userSubsetGroup,  key=lambda x: len(x[1]), reverse=True)

Now lets look at the first user

In [60]:
userSubsetGroup[0:3]

[(38875,          userId  movieId  rating
  3590618   38875        1     4.5
  3590619   38875        2     2.0
  3590719   38875      296     5.0
  3590850   38875     1035     3.0
  3590902   38875     1274     3.5
  3591041   38875     1968     4.0
  3591291   38875     3576     4.0
  3591550   38875     8593     4.0), (74551,          userId  movieId  rating
  6953204   74551        1     4.5
  6953205   74551        2     2.5
  6953376   74551      296     4.5
  6953751   74551     1035     3.5
  6953895   74551     1274     3.5
  6954179   74551     1968     5.0
  6955027   74551     3576     3.5
  6956586   74551     8593     2.5), (84039,          userId  movieId  rating
  7815686   84039        1     4.0
  7815687   84039        2     2.0
  7815789   84039      296     5.0
  7815989   84039     1035     5.0
  7816091   84039     1274     2.0
  7816302   84039     1968     3.0
  7816781   84039     3576     3.5
  7817632   84039     8593     4.0)]

#### Similarity of users to input user
Next, we are going to compare all users (not really all !!!) to our specified user and find the one that is most similar.  
we're going to find out how similar each user is to the input through the __Pearson Correlation Coefficient__. It is used to measure the strength of a linear association between two variables. The formula for finding this coefficient between sets X and Y with N values can be seen in the image below. 

Why Pearson Correlation?

Pearson correlation is invariant to scaling, i.e. multiplying all elements by a nonzero constant or adding any constant to all elements. For example, if you have two vectors X and Y,then, pearson(X, Y) == pearson(X, 2 * Y + 3). This is a pretty important property in recommendation systems because for example two users might rate two series of items totally different in terms of absolute rates, but they would be similar users (i.e. with similar ideas) with similar rates in various scales .

![alt text](https://wikimedia.org/api/rest_v1/media/math/render/svg/bd1ccc2979b0fd1c1aec96e386f686ae874f9ec0 "Pearson Correlation")

The values given by the formula vary from r = -1 to r = 1, where 1 forms a direct correlation between the two entities (it means a perfect positive correlation) and -1 forms a perfect negative correlation. 

In our case, a 1 means that the two users have similar tastes while a -1 means the opposite.

We will select a subset of users to iterate through. This limit is imposed because we don't want to waste too much time going through every single user.

In [0]:
userSubsetGroup = userSubsetGroup[0:100]

Now, we calculate the Pearson Correlation between input user and subset group, and store it in a dictionary, where the key is the user Id and the value is the coefficient

In [0]:
#Store the Pearson Correlation in a dictionary, where the key is the user Id and the value is the coefficient
pearsonCorrelationDict = {}

#For every user group in our subset
for name, group in userSubsetGroup:
    #Let's start by sorting the input and current user group so the values aren't mixed up later on
    group = group.sort_values(by='movieId')
    inputMovies = inputMovies.sort_values(by='movieId')
    #Get the N for the formula
    nRatings = len(group)
    #Get the review scores for the movies that they both have in common
    temp_df = inputMovies[inputMovies['movieId'].isin(group['movieId'].tolist())]
    #And then store them in a temporary buffer variable in a list format to facilitate future calculations
    tempRatingList = temp_df['rating'].tolist()
    #Let's also put the current user group reviews in a list format
    tempGroupList = group['rating'].tolist()
    #Now let's calculate the pearson correlation between two users, so called, x and y
    Sxx = sum([i**2 for i in tempRatingList]) - pow(sum(tempRatingList),2)/float(nRatings)
    Syy = sum([i**2 for i in tempGroupList]) - pow(sum(tempGroupList),2)/float(nRatings)
    Sxy = sum( i*j for i, j in zip(tempRatingList, tempGroupList)) - sum(tempRatingList)*sum(tempGroupList)/float(nRatings)
    
    #If the denominator is different than zero, then divide, else, 0 correlation.
    if Sxx != 0 and Syy != 0:
        pearsonCorrelationDict[name] = Sxy/sqrt(Sxx*Syy)
    else:
        pearsonCorrelationDict[name] = 0

In [64]:
pearsonCorrelationDict.items()

dict_items([(38875, 0.6172133998483676), (74551, 0.6961804114562816), (84039, 0.4243398504520545), (125410, 0.7482387262365794), (185430, 0.12027695586485274), (216818, 0.8229511997978235), (224750, 0.4040610178208843), (246533, 0.7715167498104595), (815, 0.48936170212766095), (2432, 0.1364442057274539), (3734, -0.15790348519997205), (10315, 0.3638512152732104), (13053, 0.38148850487162356), (13768, 0.638885507778408), (19208, 0.5348131870734851), (20319, -0.21200662374236923), (23297, 0.39828475756996007), (29218, 0.7826237921249259), (30651, 0.8703882797784898), (35213, 0.2962531982051989), (37148, -0.38364304085653106), (38304, 0.5544788620954262), (38450, -0.06316139407998851), (40527, 0.6525426193750007), (43287, 0.3789683644799346), (46750, 0.5560670160293553), (59164, 0.29508355326173347), (60514, 0.7023379029930387), (61364, 0.37714451164442975), (62531, 0.03528787735930545), (63110, 0.3938804945305509), (67756, 0.5870952657480973), (71498, 0.8210527751457085), (72230, -0.24812138923975677), (72256, 0.08421519210665161), (73435, 0.5975576932277314), (77231, 0.2105379802666301), (78629, 0.47293785296374496), (80261, 0.07715167498104596), (80485, 0.7592514510736501), (88318, -0.45770365415250003), (88741, 0.4912803506947182), (90645, -0.03241018617760822), (90863, 0.675364361864465), (94166, -0.027036903521793762), (98720, -0.3449302046176462), (108959, 0.5052911526399118), (110657, 0.07504691899113708), (115074, 0.6033918684573832), (116283, 0.8835604291022476), (119215, 0.224793049033144), (119741, 0.8873409830255652), (123058, 0), (129203, 0.509433992240644), (130490, 0.897285810469096), (131424, 0.18921406922703551), (132400, 0.09102525683205703), (132717, 0.5954913341754146), (135145, 0.57888373874097), (140075, 0.2767593624086669), (144628, 0.733506588173288), (145123, 0.23159177829329408), (149218, 0.7245144565800904), (150733, 0.35229742431261835), (151615, -0.32001773000527667), (154431, 0.17864740025262535), (157553, 0.1364442057274539), (160435, -0.18798593995805155), (167523, 0.8922178162191937), (169107, 0.3690124832115526), (171537, 0.5773502691896267), (174903, 0.5128206131061158), (180987, 0.6733027231936333), (181813, 0.7636364387231598), (187299, 0.5742710457985442), (187969, 0.23632829671833053), (189328, 0.44661850063155856), (192465, 0.5459626263084689), (193834, 0.6943722744631395), (197263, 0.5742710457985443), (202494, 0.5160924896186915), (207819, 0.7092081432669752), (221191, 0.4074108571913332), (221320, 0.509433992240644), (222322, 0.5306618532579177), (227452, 0.02977456670876978), (227614, -0.5996452852187765), (229481, 0.47324852428030245), (229872, -0.6534596056871291), (230236, 0.27675936240866816), (231015, 0.505291152639911), (232104, 0.5458309647504257), (232531, -0.20756952180650035), (239662, 0.5186877230929468), (239802, 0.012804154455501046), (244606, 0.46166499639462794), (245274, -0.3367238909305437), (1040, 0.8604572206191307), (1130, 0.30559571381473644), (1599, 0.387699057267636)])

In [65]:
pearsonDF = pd.DataFrame.from_dict(pearsonCorrelationDict, orient='index')
pearsonDF.columns = ['similarityIndex']
pearsonDF['userId'] = pearsonDF.index
pearsonDF.index = range(len(pearsonDF))
pearsonDF.head()

   similarityIndex  userId
0         0.617213   38875
1         0.696180   74551
2         0.424340   84039
3         0.748239  125410
4         0.120277  185430

#### The top x similar users to input user
Now let's get the top 50 users that are most similar to the input.

In [66]:
topUsers=pearsonDF.sort_values(by='similarityIndex', ascending=False)[0:50]
topUsers.head(10)

    similarityIndex  userId
54         0.897286  130490
68         0.892218  167523
51         0.887341  119741
49         0.883560  116283
18         0.870388   30651
97         0.860457    1040
5          0.822951  216818
32         0.821053   71498
17         0.782624   29218
7          0.771517  246533

Now, let's start recommending movies to the input user.

#### Rating of selected users to all movies
We're going to do this by taking the weighted average of the ratings of the movies using the Pearson Correlation as the weight. But to do this, we first need to get the movies watched by the users in our __pearsonDF__ from the ratings dataframe and then store their correlation in a new column called _similarityIndex". This is achieved below by merging of these two tables.

In [67]:
topUsersRating=topUsers.merge(ratings_df, left_on='userId', right_on='userId', how='inner')
topUsersRating.head()

   similarityIndex  userId  movieId  rating
0         0.897286  130490        1     3.0
1         0.897286  130490        2     2.5
2         0.897286  130490        3     3.0
3         0.897286  130490        5     2.5
4         0.897286  130490       10     2.5

Now all we need to do is simply multiply the movie rating by its weight (The similarity index), then sum up the new ratings and divide it by the sum of the weights.

We can easily do this by simply multiplying two columns, then grouping up the dataframe by movieId and then dividing two columns:

It shows the idea of all similar users to candidate movies for the input user:

In [68]:
#Multiplies the similarity by the user's ratings
topUsersRating['weightedRating'] = topUsersRating['similarityIndex']*topUsersRating['rating']
topUsersRating.head()

   similarityIndex  userId  movieId  rating  weightedRating
0         0.897286  130490        1     3.0        2.691857
1         0.897286  130490        2     2.5        2.243215
2         0.897286  130490        3     3.0        2.691857
3         0.897286  130490        5     2.5        2.243215
4         0.897286  130490       10     2.5        2.243215

In [69]:
#Applies a sum to the topUsers after grouping it up by userId
tempTopUsersRating = topUsersRating.groupby('movieId').sum()[['similarityIndex','weightedRating']]
tempTopUsersRating.columns = ['sum_similarityIndex','sum_weightedRating']
tempTopUsersRating.head()

         sum_similarityIndex  sum_weightedRating
movieId
1                  32.199621          128.527810
2                  31.737956           79.089079
3                  15.798521           41.417088
4                   5.453482           14.903832
5                  16.095377           38.191849

In [70]:
#Creates an empty dataframe
recommendation_df = pd.DataFrame()
#Now we take the weighted average
recommendation_df['weighted average recommendation score'] = tempTopUsersRating['sum_weightedRating']/tempTopUsersRating['sum_similarityIndex']
recommendation_df['movieId'] = tempTopUsersRating.index
recommendation_df.head()

         weighted average recommendation score  movieId
movieId
1                                     3.991594        1
2                                     2.491940        2
3                                     2.621580        3
4                                     2.732902        4
5                                     2.372846        5

Now let's sort it and see the top 20 movies that the algorithm recommended!

In [71]:
recommendation_df = recommendation_df.sort_values(by='weighted average recommendation score', ascending=False)
recommendation_df.head(10)

         weighted average recommendation score  movieId
movieId
2711                                       5.0     2711
4806                                       5.0     4806
26208                                      5.0    26208
93988                                      5.0    93988
27156                                      5.0    27156
1181                                       5.0     1181
8785                                       5.0     8785
85312                                      5.0    85312
1156                                       5.0     1156
49513                                      5.0    49513

In [72]:
movies_df.loc[movies_df['movieId'].isin(recommendation_df.head(10)['movieId'].tolist())]

       movieId                                              title  year
1133      1156  Children Are Watching Us, The (Bambini ci guar...  1944
1158      1181                                       Shooter, The  1997
2626      2711                                     My Life So Far  1999
4711      4806         Shop on Main Street, The (Obchod na korze)  1965
8103      8785                             Early Summer (Bakushû)  1951
8688     26208             My Night At Maud's (Ma Nuit Chez Maud)  1969
9219     27156  Neon Genesis Evangelion: The End of Evangelion...  1997
11489    49513  Brighter Summer Day, A (Gu ling jie shao nian ...  1991
16898    85312          House of Small Cubes, The (Tsumiki no ie)  2008
18942    93988                                      North & South  2004

### Advantages and Disadvantages of Collaborative Filtering

##### Advantages
* Takes other user's ratings into consideration
* Doesn't need to study or extract information from the recommended item
* Adapts to the user's interests which might change over time

##### Disadvantages
* Approximation function can be slow
* There might be a low of amount of users to approximate
* Privacy issues when trying to learn the user's preferences

<h2>Want to learn more?</h2>

IBM SPSS Modeler is a comprehensive analytics platform that has many machine learning algorithms. It has been designed to bring predictive intelligence to decisions made by individuals, by groups, by systems – by your enterprise as a whole. A free trial is available through this course, available here: <a href="http://cocl.us/ML0101EN-SPSSModeler">SPSS Modeler</a>

Also, you can use Watson Studio to run these notebooks faster with bigger datasets. Watson Studio is IBM's leading cloud solution for data scientists, built by data scientists. With Jupyter notebooks, RStudio, Apache Spark and popular libraries pre-packaged in the cloud, Watson Studio enables data scientists to collaborate on their projects without having to install anything. Join the fast-growing community of Watson Studio users today with a free account at <a href="https://cocl.us/ML0101EN_DSX">Watson Studio</a>

<h3>Thanks for completing this lesson!</h3>

<h4>Author:  <a href="https://ca.linkedin.com/in/saeedaghabozorgi">Saeed Aghabozorgi</a></h4>
<p><a href="https://ca.linkedin.com/in/saeedaghabozorgi">Saeed Aghabozorgi</a>, PhD is a Data Scientist in IBM with a track record of developing enterprise level applications that substantially increases clients’ ability to turn data into actionable knowledge. He is a researcher in data mining field and expert in developing advanced analytic methods like machine learning and statistical modelling on large datasets.</p>

<hr>

<p>Copyright &copy; 2018 <a href="https://cocl.us/DX0108EN_CC">Cognitive Class</a>. This notebook and its source code are released under the terms of the <a href="https://bigdatauniversity.com/mit-license/">MIT License</a>.</p>